###################################################################

# Created by write_sdc on Tue Nov  9 02:45:01 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports Vout]
set_load -pin_load 3.40189 [get_ports {Dout[13]}]
set_load -pin_load 3.40189 [get_ports {Dout[12]}]
set_load -pin_load 3.40189 [get_ports {Dout[11]}]
set_load -pin_load 3.40189 [get_ports {Dout[10]}]
set_load -pin_load 3.40189 [get_ports {Dout[9]}]
set_load -pin_load 3.40189 [get_ports {Dout[8]}]
set_load -pin_load 3.40189 [get_ports {Dout[7]}]
set_load -pin_load 3.40189 [get_ports {Dout[6]}]
set_load -pin_load 3.40189 [get_ports {Dout[5]}]
set_load -pin_load 3.40189 [get_ports {Dout[4]}]
set_load -pin_load 3.40189 [get_ports {Dout[3]}]
set_load -pin_load 3.40189 [get_ports {Dout[2]}]
set_load -pin_load 3.40189 [get_ports {Dout[1]}]
set_load -pin_load 3.40189 [get_ports {Dout[0]}]
create_clock [get_ports Ck]  -name CLK  -period 9.8  -waveform {0 4.9}
set_clock_uncertainty 0.07  [get_clocks CLK]
set_input_delay -clock CLK  -max 0.5  [get_ports {Din[13]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {Din[12]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {Din[11]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {Din[10]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {Din[9]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {Din[8]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {Din[7]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {Din[6]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {Din[5]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {Din[4]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {Din[3]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {Din[2]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {Din[1]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {Din[0]}]
set_input_delay -clock CLK  -max 0.5  [get_ports Vin]
set_input_delay -clock CLK  -max 0.5  [get_ports Rst_n]
set_input_delay -clock CLK  -max 0.5  [get_ports {b0[13]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b0[12]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b0[11]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b0[10]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b0[9]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b0[8]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b0[7]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b0[6]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b0[5]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b0[4]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b0[3]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b0[2]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b0[1]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b0[0]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b1[13]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b1[12]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b1[11]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b1[10]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b1[9]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b1[8]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b1[7]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b1[6]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b1[5]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b1[4]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b1[3]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b1[2]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b1[1]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b1[0]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b2[13]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b2[12]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b2[11]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b2[10]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b2[9]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b2[8]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b2[7]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b2[6]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b2[5]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b2[4]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b2[3]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b2[2]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b2[1]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b2[0]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b3[13]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b3[12]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b3[11]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b3[10]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b3[9]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b3[8]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b3[7]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b3[6]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b3[5]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b3[4]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b3[3]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b3[2]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b3[1]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b3[0]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b4[13]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b4[12]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b4[11]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b4[10]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b4[9]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b4[8]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b4[7]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b4[6]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b4[5]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b4[4]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b4[3]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b4[2]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b4[1]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {b4[0]}]
set_output_delay -clock CLK  -max 0.5  [get_ports Vout]
set_output_delay -clock CLK  -max 0.5  [get_ports {Dout[13]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {Dout[12]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {Dout[11]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {Dout[10]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {Dout[9]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {Dout[8]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {Dout[7]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {Dout[6]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {Dout[5]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {Dout[4]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {Dout[3]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {Dout[2]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {Dout[1]}]
set_output_delay -clock CLK  -max 0.5  [get_ports {Dout[0]}]
